{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/conv0/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_in/relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/conv3/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/conv3/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/conv5/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/conv5/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/_plus0", 
      "inputs": [[23, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/conv7/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 7, 7)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/conv7/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 7)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[21, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/_plus1", 
      "inputs": [[26, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 1], [33, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/btl_out/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 1], [41, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk0/_plus2", 
      "inputs": [[42, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_in/relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/conv3/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/conv3/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/conv5/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/conv5/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/_plus0", 
      "inputs": [[59, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/conv7/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 7, 7)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/conv7/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 7)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[57, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/_plus1", 
      "inputs": [[62, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0], [68, 0, 1], [69, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/btl_out/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 1], [77, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk1/_plus2", 
      "inputs": [[78, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 1], [83, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_in/relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/conv3/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/conv3/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/conv5/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/conv5/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/_plus0", 
      "inputs": [[95, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/conv7/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 7, 7)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/conv7/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 7)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[93, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/_plus1", 
      "inputs": [[98, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0], [104, 0, 1], [105, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[107, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/btl_out/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[109, 0, 0], [110, 0, 0], [111, 0, 0], [112, 0, 1], [113, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk2/_plus2", 
      "inputs": [[114, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0], [126, 0, 1], [127, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_in/relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/conv3/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/conv3/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/conv5/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 5, 5)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/conv5/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/_plus0", 
      "inputs": [[131, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/conv7/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 0, 7, 7)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/conv7/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(7, 7)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "8", 
        "pad": "(3, 3)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[129, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/_plus1", 
      "inputs": [[134, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0], [139, 0, 0], [140, 0, 1], [141, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/btl_out/batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0], [147, 0, 0], [148, 0, 1], [149, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk3/_plus2", 
      "inputs": [[150, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk4/btl_in/batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cifar10_pydmobilenet56_0.25_plus/stg0/blk4/btl_in/batchnorm0_beta", 
      "attrs": {
